#Working with CSVs

Reading & Writing Files in Pandas

In [1]:
import pandas as pd

In [3]:
#Read CSV
df = pd.read_csv("data.csv")
df

      Name  school  marks
0  Shubham     SPS     34
1   Joshua     UPS     45
2     Jack     WPS     56
3     Alex     ULS     67
4  Jasmine     RTS     78
5    Rohan     RRY     89
6    Rishi  Luxury     90
7   Aakash     BBL     79

In [4]:
df = df[df['marks']>50]

In [5]:
df

      Name  school  marks
2     Jack     WPS     56
3     Alex     ULS     67
4  Jasmine     RTS     78
5    Rohan     RRY     89
6    Rishi  Luxury     90
7   Aakash     BBL     79

In [8]:
#write 
df.to_csv("data_updated.csv", index=False)

#Excel Files

In [10]:
df1 = pd.read_excel("data.xlsx")

In [11]:
df1

      Name  school  marks
0  Shubham     SPS     34
1   Joshua     UPS     45
2     Jack     WPS     56
3     Alex     ULS     67
4  Jasmine     RTS     78
5    Rohan     RRY     89
6    Rishi  Luxury     90
7   Aakash     BBL     79

In [13]:
df1.to_excel("output.xlsx", index=False)

In [18]:
df2 = pd.read_excel("data.xlsx")
df2

      Name  school  marks
0  Shubham     SPS     34
1   Joshua     UPS     45
2     Jack     WPS     56
3     Alex     ULS     67
4  Jasmine     RTS     78
5    Rohan     RRY     89
6    Rishi  Luxury     90
7   Aakash     BBL     79

In [19]:
#Multiple sheets:
with pd.ExcelWriter("report.xlsx") as writer:
    df1.to_excel(writer, sheet_name="Summary", index=False)
    df2.to_excel(writer, sheet_name="Details", index=False)

#JSON Files

In [20]:
df3 = pd.read_json("data.json")

In [21]:
df3

      name         lan
0  ajinkya      pyhton
1     jack  javascript